{
  "quiz": {
    "length": "Medium",
    "greasy_roots": true,
    "split_ends": false,
    "dryness": "somewhat dry",
    "shine": "super shiny, almost reflective",
    "colored": "Occasionally",
    "heat": "Rarely"
  },
  "image_analysis": "Based on the provided image and its crops, here's an analysis of the hair condition:\n\n*   **Hair Type:** The hair appears to be naturally dark, with a wavy to curly texture.\n\n*   **Dryness:** The hair shows signs of moderate dryness. It lacks a smooth, hydrated look and instead has a slightly matte or coarse appearance, which is common in hair that could benefit from more moisture. It doesn't look severely parched or brittle, but it's not deeply hydrated either.\n\n*   **Shine:** There is a noticeable lack of shine. The hair appears predominantly matte, reflecting very little light. This suggests the cuticles might be raised or the hair is lacking sufficient natural oils/hydration to create a smooth, reflective surface.\n\n*   **Frizz:** Frizz is visibly present, particularly around the crown and along the lengths of the hair. This is typical for curly/wavy hair, especially if it lacks moisture or has some cuticle damage, contributing to a less defined and somewhat unruly texture.\n\n*   **Split Ends:** Due to the dark color, curly texture, and the resolution of the image, it is **very difficult to definitively identify individual split ends.** While the presence of frizz and moderate dryness often correlates with split ends, they are not clearly visible in this photograph.\n\n*   **Visible Damage (other than frizz/split ends):** There are no obvious signs of severe damage such as extensive breakage, thinning, or chemical damage (like from coloring or heat styling). The hair appears to be in its natural state, with the primary concerns being dryness and frizz, which are common for this hair type and often indicate a need for more hydration and gentle care.",
  "recommendation": {
    "recommended_line": "Oil Nutritive",
    "reason": "Your hair exhibits moderate dryness, a noticeable lack of shine, and frizz according to the image analysis, which align with \"dull hair\" needing \"nourishment\" and products that add \"shine and smoothness.\" This line will provide the deeper care needed for your hair's current condition.",
    "product_routine": "Oil Nutritive Shampoo + Oil Nutritive Conditioner + Oil Nutritive Intensive Repair Mask",
    "alternative": "Aqua Revive. While it provides moisture for somewhat dry hair, your hair's visible dullness and frizz suggest a need for more intensive nourishment and shine enhancement that Oil Nutritive offers."
  }
}