{
  "quiz": {
    "length": "Medium",
    "greasy_roots": true,
    "split_ends": true,
    "dryness": "somewhat dry",
    "shine": "a little dull",
    "colored": "Never",
    "heat": "Rarely"
  },
  "image_analysis": "Based on the provided image, here is an analysis of the hair condition:\n\n*   **Dryness:** The hair appears to be quite dry. It lacks a healthy luster and instead has a more matte finish, especially visible in the mid-lengths and ends. Individual strands often stand apart rather than clumping together, which is a common characteristic of dry hair lacking sufficient moisture.\n*   **Shine:** There is very low natural shine. The hair absorbs light more than it reflects it, indicating a raised or rough cuticle layer.\n*   **Frizz:** Significant frizz is noticeable, particularly around the crown and along the length of the hair. Many individual strands appear to be flying away or standing out, creating a somewhat unruly texture rather than smooth, defined waves or curls.\n*   **Split Ends:** While individual split ends are not clearly discernible at this resolution, the ends of the hair appear somewhat thinner and less cohesive than the rest of the strand. This, coupled with the overall dryness and frizz, suggests that split ends are likely present or the hair is prone to them and could benefit from a trim.\n*   **Visible Damage:** The primary visible damage manifests as dryness and frizz, which indicate a compromised outer cuticle layer. There are no obvious signs of severe breakage (like very short, jagged pieces throughout the length), or major chemical damage. The hair appears to have good overall density, but its texture suggests it would benefit from deep conditioning and moisturizing treatments to improve its health and appearance.",
  "recommendation": {
    "recommended_line": "Oil Nutritive",
    "reason": "Your hair is quite dry, dull, and prone to split ends and frizz. Oil Nutritive deeply nourishes, adds shine, and smooths for healthier, more resilient hair.",
    "product_routine": "Oil Nutritive Shampoo + Oil Nutritive Conditioner + Oil Nutritive 4-in-1 Mask",
    "alternative": null
  }
}